mhd-riaz/Arduino/esp32-scheduler/esp32-scheduler.ino
#if ESP_ARDUINO_VERSION_MAJOR >= 3
// ESP32 Arduino Core 3.0+ - Use modern tone() API
#define BUZZER_INIT(pin, freq, resolution)  // No initialization needed for tone()
#define BUZZER_TONE(pin, frequency) tone(pin, frequency)
#define BUZZER_OFF(pin) noTone(pin)
#else
// ESP32 Arduino Core 2.x - Use legacy LEDC API
#define BUZZER_INIT(pin, freq, resolution) ledcAttach(pin, freq, resolution)
#define BUZZER_TONE(pin, frequency) ledcWriteTone(pin, frequency)
#define BUZZER_OFF(pin) ledcWriteTone(pin, 0)
#endif

// ============================================================================
// 1.5. Constants and Limits (Optimized)
// ============================================================================
#define MAX_POST_BODY_SIZE 1536   // Reduced from 2048 for better memory usage
#define MAX_JSON_DOC_SIZE 2048    // Reduced from 4096 for better memory usage
#define RESPONSE_BUFFER_SIZE 512  // Buffer for HTTP responses

// Override Constants
#define PERMANENT_OVERRIDE_VALUE ULONG_MAX  // Value used to indicate permanent override

// Temperature Sensor Constants
// #define DEVICE_DISCONNECTED_C -127.0  // DallasTemperature library constant for sensor error (already defined by DallasTemperature)



// ============================================================================
// 1.6. PROGMEM String Literals (Memory Optimization)
// ============================================================================
// Store frequently used strings in flash memory to save RAM
const char PROGMEM STR_OK[] = "OK";
const char PROGMEM STR_ERROR[] = "Error";
const char PROGMEM STR_SUCCESS[] = "Success";
const char PROGMEM STR_INVALID[] = "Invalid";
const char PROGMEM STR_JSON_PARSE_ERROR[] = "JSON parse error";
const char PROGMEM STR_MISSING_PARAMS[] = "Missing required parameters";
const char PROGMEM STR_INVALID_API_KEY[] = "Invalid API key";
const char PROGMEM STR_APPLIANCE_NOT_FOUND[] = "Appliance not found";
const char PROGMEM STR_CONTENT_TYPE_JSON[] = "application/json";
const char PROGMEM STR_ACCESS_CONTROL[] = "Access-Control-Allow-Origin";
const char PROGMEM STR_WILDCARD[] = "*";


// ============================================================================
// 2. Pin Definitions
// ============================================================================
// Appliance Relay Pins (Final GPIO assignments for 5-device system)
#define MOTOR_RELAY_PIN 16    // Main Filter (Primary filtration system)
#define CO2_RELAY_PIN 17      // CO2 System (CO2 injection for plants)
#define LIGHT_RELAY_PIN 5     // Aquarium Lights (LED lighting system)
#define HEATER_RELAY_PIN 19   // Water Heater (Temperature control)
#define HANGON_FILTER_PIN 18  // Hang-on Filter (Secondary filtration)

// Relay Configuration
// Set to true for Active LOW relays (LOW = ON, HIGH = OFF) - Most common
// Set to false for Active HIGH relays (HIGH = ON, LOW = OFF)
#define RELAY_ACTIVE_LOW true  // Professional optocoupler modules are Active LOW

// DS18B20 Temperature Sensor Pin
#define ONE_WIRE_BUS 14  // DS18B20 data pin (requires 4.7KΩ pull-up to 3.3V)

// Buzzer Pin (PWM capable for audio feedback)
#define BUZZER_PIN 13

// OLED Display (I2C - Shared with RTC on same bus)
#define OLED_SDA 21
#define OLED_SCL 22
#define SCREEN_WIDTH 128  // OLED display width, in pixels
#define SCREEN_HEIGHT 64  // OLED display height, in pixels
#define OLED_RESET -1     // Reset pin # (or -1 if sharing Arduino reset pin)
#define I2C_ADDRESS 0x3C  // Standard address for 128x64 SSD1306 displays

// ============================================================================
// 3. Global Constants and Variables
// ============================================================================

// API Server
const char *API_KEY = "Automate@123";
AsyncWebServer server(80);  // Web server on port 80

// NVS (Non-Volatile Storage)
Preferences preferences;
const char *NVS_NAMESPACE_WIFI = "wifi_creds";
const char *NVS_NAMESPACE_SCHEDULES = "app_schedules";
const char *NVS_KEY_SSID = "ssid";
const char *NVS_KEY_PASS = "password";
const char *NVS_KEY_SCHEDULES = "schedules_json";

// Time Management (NTP + RTC System)
RTC_DS3231 rtc;
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "pool.ntp.org", 5.5 * 3600, 60000);  // IST offset (5.5 hours), update every 60s
unsigned long lastNtpSyncMillis = 0;
const unsigned long NTP_SYNC_INTERVAL_MS = 3 * 3600 * 1000;  // Sync every 3 hours when WiFi available

// Temperature Sensor & Control System
OneWire oneWire(ONE_WIRE_BUS);
DallasTemperature sensors(&oneWire);
float currentTemperatureC = -127.0;  // Initialize with sensor error value
unsigned long lastTempReadMillis = 0;
const unsigned long TEMP_READ_INTERVAL_MS = 15000;       // Normal: 15 seconds
const unsigned long TEMP_READ_ERROR_INTERVAL_MS = 5000;  // Error: 5 seconds

// DS18B20 Sensor Error Handling
bool tempSensorError = false;
unsigned long lastTempSensorErrorBuzzMillis = 0;
const unsigned long TEMP_SENSOR_ERROR_BUZZ_INTERVAL_MS = 3600000UL;  // 1 hour

// Intelligent Heater Control Logic
const float TEMP_THRESHOLD_ON = 25.0;                         // Turn heater ON if temp drops below 25°C
const float TEMP_THRESHOLD_OFF = 29.0;                        // Turn heater OFF if temp reaches/exceeds 29°C
const unsigned long HEATER_MIN_RUN_TIME_MS = 30 * 60 * 1000;  // 30 minutes minimum continuous runtime
unsigned long heaterOnTimeMillis = 0;                         // Tracks when heater was turned ON for minimum runtime
bool heaterForcedOn = false;                                  // Flag indicating temperature-controlled heater state
bool lastHeaterState = false;                                 // Cache last heater state to avoid redundant operations
int temperatureReadFailures = 0;                              // Track consecutive temperature read failures
const int MAX_TEMP_FAILURES = 8;                              // Max consecutive failures before emergency (2+ minutes)
int temperatureRecoveryCount = 0;                             // Track successful readings after failures
const int MIN_RECOVERY_READINGS = 3;                          // Require 3 good readings to clear emergency

// Appliance Management System (Optimized)
enum ApplianceState { OFF,
                      ON };
enum ApplianceMode { SCHEDULED,          // Following programmed schedule
                     OVERRIDDEN,         // Manual override active
                     TEMP_CONTROLLED };  // Temperature-controlled (heater only)

struct ScheduleEntry {
  String type;    // "on_interval" or "off_interval"
  int start_min;  // Start time in minutes from midnight (0-1439) - Optimized format
  int end_min;    // End time in minutes from midnight (0-1439) - Optimized format
};

struct Appliance {
  String name;                    // Device name (Filter, CO2, Light, Heater, HangOnFilter)
  int pin;                        // GPIO pin for relay control
  ApplianceState currentState;    // Current physical state (ON/OFF)
  ApplianceState scheduledState;  // State according to schedule
  ApplianceState overrideState;   // State from manual override
  unsigned long overrideEndTime;  // millis() when override expires (0 = no override)
  ApplianceMode currentMode;      // Current control mode (SCHEDULED/OVERRIDDEN/TEMP_CONTROLLED)
};

// Array of 5 appliance objects with custom configurations
Appliance appliances[] = {
  { "Filter", MOTOR_RELAY_PIN, OFF, OFF, OFF, 0, SCHEDULED },         // Primary filtration (GPIO 16)
  { "CO2", CO2_RELAY_PIN, OFF, OFF, OFF, 0, SCHEDULED },              // CO2 injection system (GPIO 17)
  { "Light", LIGHT_RELAY_PIN, OFF, OFF, OFF, 0, SCHEDULED },          // LED lighting system (GPIO 18)
  { "Heater", HEATER_RELAY_PIN, OFF, OFF, OFF, 0, SCHEDULED },        // Water heater with temp control (GPIO 19)
  { "HangOnFilter", HANGON_FILTER_PIN, OFF, OFF, OFF, 0, SCHEDULED }  // Secondary hang-on filter (GPIO 5)
};
const int NUM_APPLIANCES = sizeof(appliances) / sizeof(appliances[0]);

// Map to store custom schedules for each appliance (minute-based for efficiency)
std::map<String, std::vector<ScheduleEntry>> applianceSchedules;

