mhd-riaz/Arduino/esp32-scheduler/esp32-scheduler.ino
// Global POST body storage (single reusable buffer for memory optimization)
String postBody = "";

// Debug and logging configuration
#define DEBUG_MODE true  // Set to true for development, false for production to save memory
unsigned long lastDebugPrintMillis = 0;
const unsigned long DEBUG_PRINT_INTERVAL_MS = 30000;  // Print debug info every 30 seconds (reduced frequency)

// OLED Display System
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);
unsigned long lastOLEDUpdateMillis = 0;
const unsigned long OLED_UPDATE_INTERVAL_MS = 2000;  // Update every 2 seconds (memory optimized)
char oledBuffer[64];                                 // Reusable buffer for OLED text formatting

// WiFi Connection Management
const unsigned long WIFI_CONNECT_TIMEOUT_MS = 30000;  // 30 seconds for connection
bool wifiConnected = false;
bool apModeActive = false;
int wifiReconnectAttempts = 0;              // Track reconnection attempts
const int MAX_WIFI_RECONNECT_ATTEMPTS = 5;  // Max attempts before giving up
unsigned long lastWifiReconnectMillis = 0;  // Separate timing for WiFi reconnection

// Emergency Safety System
bool emergencyShutdown = false;
const float EMERGENCY_TEMP_HIGH = 32.0;                        // Emergency shutdown if temperature exceeds 32°C
const float EMERGENCY_TEMP_LOW = 15.0;                         // Emergency shutdown if temperature below 15°C
bool lastEmergencyState = false;                               // Cache to avoid redundant operations
unsigned long emergencyActivatedTime = 0;                      // Track when emergency was activated
const unsigned long EMERGENCY_RESET_TIME_MS = 30 * 60 * 1000;  // Auto-reset emergency after 30 minutes

// Emergency Reason Tracking
enum EmergencyReason {
  NO_EMERGENCY = 0,
  TEMP_TOO_HIGH,
  TEMP_TOO_LOW,
  SENSOR_FAILURE
};
EmergencyReason currentEmergencyReason = NO_EMERGENCY;

// System Health Monitoring & Alert System
unsigned long lastSystemHeartbeat = 0;
unsigned long lastLoopTime = 0;
const unsigned long SYSTEM_WATCHDOG_TIMEOUT_MS = 90000;  // 90 seconds
const unsigned long LOOP_HANG_TIMEOUT_MS = 45000;        // 45 seconds
bool systemHealthOK = true;
bool alertSounded = false;

// Schedule caching for performance
bool schedulesDirty = false;  // Flag to track if schedules need saving
unsigned long lastScheduleSaveMillis = 0;
const unsigned long SCHEDULE_SAVE_DELAY_MS = 5000;  // Save schedules 5 seconds after last change

// ============================================================================
// 4. Function Prototypes
// ============================================================================
// Core System Functions
void connectWiFi();
void startAPMode();
void buzz(int count, int delayMs);
void buzzPattern(int pattern);
void syncTimeNTP();

// System Health Monitoring
void updateSystemHeartbeat();
void checkSystemHealth();
void alertSystemFailure(const char *reason);

// Schedule Management
void loadSchedules();
void saveSchedules();
void applyApplianceLogic(Appliance &app, int currentMinutes);

// Relay Control Functions
void setRelayState(int pin, ApplianceState state);
int getRelayOffState();
int getRelayOnState();

// Display & Utility Functions
void updateOLED(DateTime now);
bool isTimeInInterval(int currentMinutes, int startMin, int endMin);
bool authenticateRequest(AsyncWebServerRequest *request);

// Emergency & Safety System
void emergencyShutdownAll();

// REST API Handlers
void handleRoot(AsyncWebServerRequest *request);
void handleStatus(AsyncWebServerRequest *request);
void handleControl(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total);
void handleGetSchedules(AsyncWebServerRequest *request);
void handlePostSchedules(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total);
void handleUpdateSingleSchedule(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total);
void handleWifiConfig(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total);
void handleNotFound(AsyncWebServerRequest *request);
void handleEmergencyReset(AsyncWebServerRequest *request);
void handleResetToSchedule(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total);
void handleForceRefresh(AsyncWebServerRequest *request);

// ============================================================================
// 4.5. Relay Control Helper Functions
// ============================================================================

/**
 * @brief Returns the digital state for relay OFF based on relay type
 * @return HIGH for active LOW relays, LOW for active HIGH relays
 */
int getRelayOffState() {
  return RELAY_ACTIVE_LOW ? HIGH : LOW;
}

/**
 * @brief Returns the digital state for relay ON based on relay type
 * @return LOW for active LOW relays, HIGH for active HIGH relays
 */
int getRelayOnState() {
  return RELAY_ACTIVE_LOW ? LOW : HIGH;
}

/**
 * @brief Sets relay state properly based on relay type configuration
 * @param pin GPIO pin connected to relay
 * @param state ApplianceState (ON or OFF)
 */
void setRelayState(int pin, ApplianceState state) {
  // Cache the current GPIO state to avoid redundant writes
  static int lastPinStates[40] = { -1 };  // ESP32 has up to 40 GPIO pins, initialize to invalid state

  int newState = (state == ON) ? getRelayOnState() : getRelayOffState();

  // Only write if state has changed
  if (pin < 40 && lastPinStates[pin] != newState) {
    digitalWrite(pin, newState);
    lastPinStates[pin] = newState;
  }
}

// ============================================================================
// 5. Setup Function
// ============================================================================
void setup() {
  // Add small delay for power stabilization
  delay(800);

  // Set CPU frequency for stability
  setCpuFrequencyMhz(160);

  Serial.begin(115200);
  Serial.println(F("\n[SETUP] Starting ESP32 Fish Tank Automation System..."));
  Serial.printf(F("[SETUP] CPU Frequency: %dMHz\n"), getCpuFrequencyMhz());

  // Add 1-second startup delay with beep indicator
  delay(1000);

  // Configure Buzzer Pin early for startup beep (ESP32 Core compatible)
  BUZZER_INIT(BUZZER_PIN, 1000, 8);  // Cross-compatible initialization

  // Startup beep to indicate system is ready
  BUZZER_TONE(BUZZER_PIN, 1500);  // 1.5kHz startup tone
  delay(300);                     // Beep duration
  BUZZER_OFF(BUZZER_PIN);         // Turn off
#if DEBUG_MODE
  Serial.println("[SETUP] System startup beep completed.");
#endif

  // Initialize NVS (WiFi namespace will be used initially)
  if (!preferences.begin(NVS_NAMESPACE_WIFI, false)) {
    Serial.println(F("[NVS] Failed to initialize WiFi preferences."));
  }

  // Initialize I2C bus
  Wire.begin(OLED_SDA, OLED_SCL);
  Wire.setClock(100000);  // Standard mode (100kHz)
  Wire.setTimeout(5000);
#if DEBUG_MODE
  Serial.println(F("[I2C] I2C bus initialized."));
#endif

  int i = 0;
  // Initialize RTC
  if (!rtc.begin()) {
    Serial.println(F("[ERROR] RTC not found!"));
    // Sound continuous error buzzer to alert user
    while (1) {
      i++;
      BUZZER_TONE(BUZZER_PIN, 3000);  // 3kHz error tone
      delay(800);                     // Buzz for 800ms
      BUZZER_OFF(BUZZER_PIN);         // Turn off
      delay(1000);                    // Wait 1 second before next buzz

