mhd-riaz/Arduino/esp32-scheduler/esp32-scheduler.ino
      // Restart ESP if RTC not found
      if (i >= 10) {
        delay(1000);
        ESP.restart();
      }
    }
  }
  // Use rtc.lostPower() to check if RTC lost power and set time if needed
  if (rtc.lostPower()) {
#if DEBUG_MODE
    Serial.println(F("[RTC] RTC is NOT running, setting time from build time."));
#endif
    rtc.adjust(DateTime(F(__DATE__), F(__TIME__)));  // Set to compile time as fallback
  }
#if DEBUG_MODE
  Serial.println(F("[RTC] RTC initialized."));
#endif

  // Initialize OLED Display
  if (!display.begin(SSD1306_SWITCHCAPVCC, I2C_ADDRESS)) {
#if DEBUG_MODE
    Serial.println(F("[ERROR] OLED init failed"));
#endif
  } else {
#if DEBUG_MODE
    Serial.println(F("[OLED] Display initialized."));
#endif
    display.clearDisplay();
    display.setTextSize(2);  // Larger text
    display.setTextColor(SSD1306_WHITE);
    display.setCursor(0, 20);  // Center-ish vertically for 64px display
    display.println("Bismillah");
    display.display();
    delay(2000);  // Show for 2 seconds
    display.clearDisplay();
    display.display();
  }

  // Initialize DS18B20 Temperature Sensor
  sensors.begin();
  sensors.setResolution(12);            // Set to 12-bit resolution for better accuracy
  sensors.setWaitForConversion(false);  // Use non-blocking mode

  // Initialize sensor state variables
  temperatureReadFailures = 0;
  temperatureRecoveryCount = 0;

  // Take an initial temperature reading
  sensors.requestTemperatures();
  delay(200);  // Wait for conversion
  float initialTemp = sensors.getTempCByIndex(0);
  if (initialTemp != DEVICE_DISCONNECTED_C && initialTemp > -50.0 && initialTemp < 100.0) {
    currentTemperatureC = initialTemp;
#if DEBUG_MODE
    Serial.printf("[DS18B20] Initial temperature reading: %.1f°C\n", currentTemperatureC);
#endif
  } else {
    currentTemperatureC = DEVICE_DISCONNECTED_C;
#if DEBUG_MODE
    Serial.println("[DS18B20] Warning: Initial temperature reading failed, using error value -127.0°C");
#endif
  }

#if DEBUG_MODE
  Serial.println("[DS18B20] Temperature sensor initialized and configured.");
#endif

  // Configure Relay Pins and ensure they are OFF initially
  for (int i = 0; i < NUM_APPLIANCES; i++) {
    pinMode(appliances[i].pin, OUTPUT);
    setRelayState(appliances[i].pin, OFF);  // Set to OFF using proper relay type
#if DEBUG_MODE
    Serial.printf("[RELAY] Pin %d (%s) set to OFF (Relay Type: %s).\n",
                  appliances[i].pin, appliances[i].name.c_str(),
                  RELAY_ACTIVE_LOW ? "Active LOW" : "Active HIGH");
#endif
  }

  // Attempt WiFi Connection
  connectWiFi();

  // If WiFi connection failed, start AP mode and buzz
  if (!wifiConnected) {
    buzz(3, 1000);  // Buzz thrice with 1000ms delay
    startAPMode();
  } else {
    // Sync RTC with NTP immediately after successful WiFi connection
    syncTimeNTP();
  }

  // Load schedules from NVS
  loadSchedules();

  // Apply initial appliance states based on current time and schedules
  DateTime now = rtc.now();
  int currentMinutes = now.hour() * 60 + now.minute();

  for (int i = 0; i < NUM_APPLIANCES; i++) {
    applyApplianceLogic(appliances[i], currentMinutes);
  }

  // Configure REST API Endpoints
  server.on("/", HTTP_GET, handleRoot);
  server.on("/status", HTTP_GET, handleStatus);
  server.on("/restart", HTTP_GET, handleRestart);  // [GET] /restart endpoint for system reboot
  server.on(
    "/control", HTTP_POST, [](AsyncWebServerRequest *request) {
      // Response will be sent by the body handler
    },
    NULL, handleControl);
  server.on("/schedules", HTTP_GET, handleGetSchedules);
  server.on(
    "/schedules", HTTP_POST, [](AsyncWebServerRequest *request) {
      // Response will be sent by the body handler
    },
    NULL, handlePostSchedules);
  server.on(
    "/schedule", HTTP_POST, [](AsyncWebServerRequest *request) {
      // Response will be sent by the body handler for single appliance update
    },
    NULL, handleUpdateSingleSchedule);
  server.on(
    "/wifi", HTTP_POST, [](AsyncWebServerRequest *request) {
      // Response will be sent by the body handler
    },
    NULL, handleWifiConfig);
  server.on("/emergency/reset", HTTP_POST, handleEmergencyReset);
  server.on(
    "/reset", HTTP_POST, [](AsyncWebServerRequest *request) {
      // Response will be sent by the body handler
    },
    NULL, handleResetToSchedule);
  server.on("/refresh", HTTP_POST, handleForceRefresh);
  server.onNotFound(handleNotFound);

  // Start the server
  server.begin();
#if DEBUG_MODE
  Serial.println("[API] REST API server started.");
#endif
  Serial.println("[SETUP] System ready!");
}

/**
 * @brief Handles the "/restart" GET endpoint. Reboots the ESP32 after authenticating the API key.
 * Responds with JSON and then triggers ESP.restart().
 */
void handleRestart(AsyncWebServerRequest *request) {
  if (!authenticateRequest(request)) return;
  request->send(200, "application/json", "{\"status\": \"success\", \"message\": \"System will reboot now\"}\n");
  delay(1000);  // Allow response to be sent
  ESP.restart();
}

// ============================================================================
// 6. Loop Function
// ============================================================================
void loop() {
  // Handle WiFi reconnection if disconnected
  if (WiFi.status() != WL_CONNECTED && !apModeActive) {
    if ((long)(millis() - lastWifiReconnectMillis) > 5000) {  // Check every 5 seconds
      connectWiFi();
      lastWifiReconnectMillis = millis();
    }
  }

  // Periodically sync RTC with NTP (every 3 hours, if WiFi available)
  if (wifiConnected && ((long)(millis() - lastNtpSyncMillis) >= NTP_SYNC_INTERVAL_MS)) {
    syncTimeNTP();
    lastNtpSyncMillis = millis();
  }

  // Get current time from RTC
  DateTime now = rtc.now();
  int currentMinutes = now.hour() * 60 + now.minute();  // Convert to minutes once

  // Read temperature more frequently if sensor error
  unsigned long tempReadInterval = tempSensorError ? TEMP_READ_ERROR_INTERVAL_MS : TEMP_READ_INTERVAL_MS;
  if ((long)(millis() - lastTempReadMillis) >= tempReadInterval) {
    sensors.requestTemperatures();
    delay(50);  // Give sensor time to complete conversion
    float tempReading = sensors.getTempCByIndex(0);

    if (tempReading != DEVICE_DISCONNECTED_C && tempReading > -50.0 && tempReading < 100.0) {
      // Valid temperature reading
      currentTemperatureC = (currentTemperatureC * 0.9) + (tempReading * 0.1);
      if (tempSensorError) {
        tempSensorError = false;  // Sensor recovered
        lastTempSensorErrorBuzzMillis = 0;
      }
      // Track recovery after failures
      if (temperatureReadFailures > 0) {
        temperatureRecoveryCount++;
#if DEBUG_MODE
        Serial.printf(F("[TEMP] Recovery reading %d/%d (%.1f°C)\n"),
                      temperatureRecoveryCount, MIN_RECOVERY_READINGS, tempReading);
#endif
        // Only reset failures after multiple successful readings
        if (temperatureRecoveryCount >= MIN_RECOVERY_READINGS) {
          temperatureReadFailures = 0;
          temperatureRecoveryCount = 0;
#if DEBUG_MODE
          Serial.println(F("[TEMP] Sensor recovery confirmed - failures reset"));
#endif
        }
      } else {
        temperatureRecoveryCount = 0;  // Reset recovery counter when sensor is stable
      }
    } else {
      // Temperature sensor failure detected
      if (temperatureReadFailures < MAX_TEMP_FAILURES) {
        temperatureReadFailures++;
        temperatureRecoveryCount = 0;  // Reset recovery on new failure
        tempSensorError = true;
#if DEBUG_MODE
        Serial.printf(F("[TEMP] Sensor read failure %d/%d (Reading: %.1f)\n"),
                      temperatureReadFailures, MAX_TEMP_FAILURES, tempReading);
#endif
        // No emergency shutdown for temp sensor failure; just log and warn (handled elsewhere)
      }
    }
    lastTempReadMillis = millis();
  }

  // DS18B20 Sensor Error: Spontaneous 3-buzz warning every hour
  if (tempSensorError) {
    if (lastTempSensorErrorBuzzMillis == 0 || (millis() - lastTempSensorErrorBuzzMillis) >= TEMP_SENSOR_ERROR_BUZZ_INTERVAL_MS) {
      buzz(3, 300);  // 3 quick buzzes
      lastTempSensorErrorBuzzMillis = millis();
    }
  }

  // Check emergency conditions - exclude zero/invalid values to prevent false alarms
  bool currentEmergencyState = false;
  EmergencyReason newEmergencyReason = NO_EMERGENCY;

  if (currentTemperatureC > 0.0) {
    // Only check temperature limits if we have valid readings
    if (currentTemperatureC > EMERGENCY_TEMP_HIGH) {
      currentEmergencyState = true;
      newEmergencyReason = TEMP_TOO_HIGH;
    } else if (currentTemperatureC < EMERGENCY_TEMP_LOW) {
      currentEmergencyState = true;
      newEmergencyReason = TEMP_TOO_LOW;
    }
  }
  // Do NOT trigger emergency for temp sensor failure anymore

  // Update emergency reason when state changes
  if (currentEmergencyState) {
    currentEmergencyReason = newEmergencyReason;
  }

