mhd-riaz/Arduino/esp32-scheduler/esp32-scheduler.ino
  // Auto-reset emergency after timeout or when conditions are safe
  if (emergencyShutdown && emergencyActivatedTime > 0) {
    bool timeoutReset = (long)(millis() - emergencyActivatedTime) >= EMERGENCY_RESET_TIME_MS;
    bool conditionsSafe = (currentTemperatureC > 0.0 && currentTemperatureC > EMERGENCY_TEMP_LOW && currentTemperatureC < EMERGENCY_TEMP_HIGH && temperatureReadFailures == 0 && temperatureRecoveryCount == 0);  // Only reset when sensor is fully stable

    if (timeoutReset || conditionsSafe) {
      emergencyShutdown = false;
      emergencyActivatedTime = 0;
      temperatureReadFailures = 0;            // Reset failure counter
      temperatureRecoveryCount = 0;           // Reset recovery counter
      currentEmergencyReason = NO_EMERGENCY;  // Reset emergency reason
#if DEBUG_MODE
      Serial.println(timeoutReset ? F("[EMERGENCY] Auto-reset after timeout - System resumed") : F("[EMERGENCY] Auto-reset: Conditions safe - System resumed"));
#endif
      buzz(2, 300);  // Confirmation buzzes
    }
  }

  if (currentEmergencyState != lastEmergencyState) {
    emergencyShutdown = currentEmergencyState;
    lastEmergencyState = currentEmergencyState;
    if (emergencyShutdown) {
      emergencyActivatedTime = millis();
#if DEBUG_MODE
      Serial.printf(F("[EMERGENCY] Temperature %.1f°C or sensor failure - Shutting down all appliances\n"),
                    currentTemperatureC);
#endif
    }
  }

  // Apply appliance control logic (unless emergency shutdown)
  if (!emergencyShutdown) {
    for (int i = 0; i < NUM_APPLIANCES; i++) {
      applyApplianceLogic(appliances[i], currentMinutes);
    }
  }

// Conditional debug output (only if DEBUG_MODE enabled and reduced frequency)
#if DEBUG_MODE
  if ((long)(millis() - lastDebugPrintMillis) >= DEBUG_PRINT_INTERVAL_MS) {
    Serial.printf(F("[DEBUG] %02d:%02d T:%.1f°C Heap:%u Emergency:%s\n"),
                  now.hour(), now.minute(), currentTemperatureC, ESP.getFreeHeap(),
                  emergencyShutdown ? "Y" : "N");
    lastDebugPrintMillis = millis();
  }
#endif

  // Update OLED display periodically (for time updates when no state changes)
  if ((long)(millis() - lastOLEDUpdateMillis) >= OLED_UPDATE_INTERVAL_MS) {
    updateOLED(now);
    lastOLEDUpdateMillis = millis();
  }

  // Handle delayed schedule saving
  handleDelayedScheduleSave();
}

// ============================================================================
// 7. Helper Functions (Optimized)
// ============================================================================

/**
 * @brief Connects to a saved WiFi network
 */
void connectWiFi() {
  // Check if we've exceeded reconnection attempts
  if (wifiReconnectAttempts >= MAX_WIFI_RECONNECT_ATTEMPTS) {
    wifiConnected = false;
    return;
  }

  // Switch to WiFi namespace to read credentials
  preferences.end();  // End current namespace
  if (!preferences.begin(NVS_NAMESPACE_WIFI, false)) {
    Serial.println(F("[NVS] Failed to open WiFi namespace."));
    wifiConnected = false;
    wifiReconnectAttempts++;
    return;
  }

  String ssid = preferences.getString(NVS_KEY_SSID, "");
  String password = preferences.getString(NVS_KEY_PASS, "");

  if (ssid.length() == 0) {
#if DEBUG_MODE
    Serial.println(F("[WiFi] No saved WiFi credentials. Cannot connect to STA mode."));
#endif
    wifiConnected = false;
    return;
  }

#if DEBUG_MODE
  Serial.printf(F("[WiFi] Attempting to connect to SSID: %s (Attempt %d/%d)\n"),
                ssid.c_str(), wifiReconnectAttempts + 1, MAX_WIFI_RECONNECT_ATTEMPTS);
#endif
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.begin(ssid.c_str(), password.c_str());

  unsigned long startTime = millis();
  int dotCount = 0;
  // For scrolling SSID
  static int ssidScrollOffset = 0;
  static unsigned long lastScrollMillis = 0;
  const int scrollDelay = 250;  // ms per scroll step
  while (WiFi.status() != WL_CONNECTED && (long)(millis() - startTime) < WIFI_CONNECT_TIMEOUT_MS) {
    delay(1000);
#if DEBUG_MODE
    Serial.print(".");
#endif
    // Update display every 3 seconds
    if (++dotCount % 3 == 0) {
      display.clearDisplay();
      display.setTextSize(1);  // Smallest font for max info
      display.setTextColor(SSD1306_WHITE);
      display.setCursor(0, 0);
      display.println(F("Connecting to SSID:"));
      // Scroll SSID if too long
      int maxVisibleChars = 18;  // 18 chars at size 1 (128px/7px)
      int ssidLen = ssid.length();
      String ssidToShow;
      if (ssidLen > maxVisibleChars) {
        // Scroll the SSID horizontally
        if (millis() - lastScrollMillis > scrollDelay) {
          ssidScrollOffset = (ssidScrollOffset + 1) % (ssidLen + 2);  // +2 for smooth loop
          lastScrollMillis = millis();
        }
        if (ssidScrollOffset + maxVisibleChars <= ssidLen) {
          ssidToShow = ssid.substring(ssidScrollOffset, ssidScrollOffset + maxVisibleChars);
        } else {
          // Wrap around
          int firstPart = ssidLen - ssidScrollOffset;
          ssidToShow = ssid.substring(ssidScrollOffset);
          ssidToShow += "  ";
          ssidToShow += ssid.substring(0, maxVisibleChars - firstPart);
        }
      } else {
        ssidToShow = ssid;
      }
      display.setCursor(0, 10);
      display.println(ssidToShow);
      snprintf(oledBuffer, sizeof(oledBuffer), "Attempt %d/%d", wifiReconnectAttempts + 1, MAX_WIFI_RECONNECT_ATTEMPTS);
      display.setCursor(0, 20);
      display.println(oledBuffer);
      display.display();
    }
  }

  if (WiFi.status() == WL_CONNECTED) {
#if DEBUG_MODE
    Serial.println(F("\n[WiFi] Connected to WiFi!"));
    Serial.print(F("[WiFi] IP Address: "));
    Serial.println(WiFi.localIP());
#endif
    wifiConnected = true;
    apModeActive = false;
    wifiReconnectAttempts = 0;  // Reset attempt counter on successful connection
  } else {
#if DEBUG_MODE
    Serial.println(F("\n[WiFi] Failed to connect to WiFi."));
#endif
    wifiConnected = false;
    wifiReconnectAttempts++;
  }

  // Close WiFi namespace
  preferences.end();
}

/**
 * @brief Starts the ESP32 in Access Point (AP) mode for configuration.
 */
void startAPMode() {
#if DEBUG_MODE
  Serial.println("[AP] Starting Access Point mode...");
#endif
  WiFi.mode(WIFI_AP);
  // Set constant AP IP: 192.168.0.1 (gateway and subnet match)
  IPAddress apIP(192, 168, 0, 1);
  IPAddress apGateway(192, 168, 0, 1);
  IPAddress apSubnet(255, 255, 255, 0);
  WiFi.softAPConfig(apIP, apGateway, apSubnet);
  WiFi.softAP("MyTank", "password@123");  // Default AP name and password
  apIP = WiFi.softAPIP();
#if DEBUG_MODE
  Serial.print("[AP] AP IP address: ");
  Serial.println(apIP);
#endif
  apModeActive = true;

  display.clearDisplay();
  display.setCursor(0, 0);
  display.println("AP Mode Active:");
  display.setCursor(0, 10);
  display.println("SSID: MyTank");
  display.setCursor(0, 20);
  display.println("Pass: password@123");
  display.setCursor(0, 30);
  display.print("IP: ");
  display.println(apIP);
  display.display();
}

/**
 * @brief Produces a buzzing sound from the buzzer.
 * @param count Number of buzzes.
 * @param delayMs Delay between buzzes in milliseconds.
 */
void buzz(int count, int delayMs) {
#if DEBUG_MODE
  Serial.printf("[BUZZER] Buzzing %d times...\n", count);
#endif
  for (int i = 0; i < count; i++) {
    BUZZER_TONE(BUZZER_PIN, 1000);  // 1kHz tone
    delay(200);                     // Buzz duration
    BUZZER_OFF(BUZZER_PIN);         // Turn off
    if (i < count - 1) {
      delay(delayMs);
    }
  }
}

/**
 * @brief Synchronizes the DS1307 RTC with an NTP server.
 */
void syncTimeNTP() {
  if (WiFi.status() == WL_CONNECTED) {
#if DEBUG_MODE
    Serial.println("[NTP] Syncing time with NTP server...");
#endif
    timeClient.begin();
    if (timeClient.forceUpdate()) {
      unsigned long epochTime = timeClient.getEpochTime();
      rtc.adjust(DateTime(epochTime));
#if DEBUG_MODE
      Serial.printf("[NTP] RTC adjusted to: %s\n", rtc.now().timestamp().c_str());
#endif
      timeClient.end();  // End NTP client to free resources
    } else {
#if DEBUG_MODE
      Serial.println("[NTP] Failed to get time from NTP server.");
#endif
    }
  } else {
#if DEBUG_MODE
    Serial.println("[NTP] WiFi not connected, skipping NTP sync.");
#endif
  }
}

/**
 * @brief Loads the default factory schedules and saves them to NVS.
 * This function is used for initial setup and factory reset.
 */
void loadDefaultSchedules() {
  // Clear existing schedules
  applianceSchedules.clear();

  // Define custom default schedules (all times converted to minutes for efficiency)
  // CO2: 8:30 AM - 1:30 PM (510-810), 3:30 PM - 8:30 PM (930-1230)
  applianceSchedules["CO2"].push_back({ "on_interval", 510, 810 });
  applianceSchedules["CO2"].push_back({ "on_interval", 930, 1230 });

