mhd-riaz/Arduino/esp32-scheduler/esp32-scheduler.ino
  // Light: 9:30 AM - 1:30 PM (570-810), 4:30 PM - 8:30 PM (990-1230)
  applianceSchedules["Light"].push_back({ "on_interval", 570, 810 });
  applianceSchedules["Light"].push_back({ "on_interval", 990, 1230 });

  // Heater: 12:00 AM - 4:30 AM (0-270), 8:30 PM - 11:59 PM (1230-1439)
  applianceSchedules["Heater"].push_back({ "on_interval", 0, 270 });
  applianceSchedules["Heater"].push_back({ "on_interval", 1230, 1439 });

  // Hang-on Filter: 6:30 AM - 8:30 AM (390-510), 8:30 PM - 10:30 PM (1230-1350)
  applianceSchedules["HangOnFilter"].push_back({ "on_interval", 390, 510 });
  applianceSchedules["HangOnFilter"].push_back({ "on_interval", 1230, 1350 });

  // Filter: 1:30 PM - 3:30 PM (810-930) - OFF during this time for maintenance
  applianceSchedules["Filter"].push_back({ "off_interval", 810, 930 });

  markSchedulesDirty();  // Schedule delayed save

#if DEBUG_MODE
  Serial.println(F("[Factory Reset] Default schedules loaded:"));
  Serial.println(F("  CO2: 8:30-13:30 (510-810), 15:30-20:30 (930-1230)"));
  Serial.println(F("  Light: 9:30-13:30 (570-810), 16:30-20:30 (990-1230)"));
  Serial.println("  Heater: 0:00-4:30 (0-270), 20:30-23:59 (1230-1439)");
  Serial.println("  HangOnFilter: 6:30-8:30 (390-510), 20:30-22:30 (1230-1350)");
  Serial.println("  Filter: OFF 13:30-15:30 (810-930), otherwise ON");
#endif
}

/**
 * @brief Loads appliance schedules from NVS. If no schedules are found,
 * custom default schedules optimized for fish tank automation are loaded and saved to NVS.
 * 
 * Default Schedule Summary:
 * - CO2: 8:30 AM - 1:30 PM (510-810), 3:30 PM - 8:30 PM (930-1230)
 * - Light: 9:30 AM - 1:30 PM (570-810), 4:30 PM - 8:30 PM (990-1230)  
 * - Heater: 12:00 AM - 4:30 AM (0-270), 8:30 PM - 11:59 PM (1230-1439)
 * - HangOnFilter: 6:30 AM - 8:30 AM (390-510), 8:30 PM - 10:30 PM (1230-1350)
 * - Filter: Continuous except 1:30 PM - 3:30 PM (810-930) for maintenance
 */
void loadSchedules() {
  // Switch to schedules namespace
  preferences.end();  // End current namespace
  if (!preferences.begin(NVS_NAMESPACE_SCHEDULES, false)) {
    Serial.println("[NVS] Failed to open schedules namespace.");
    return;
  }

  String schedulesJson = preferences.getString(NVS_KEY_SCHEDULES, "");

  if (schedulesJson.length() == 0) {
#if DEBUG_MODE
    Serial.println("[NVS] No schedules found in NVS. Loading custom default schedules...");
#endif
    loadDefaultSchedules();
    return;
  }

#if DEBUG_MODE
  Serial.println("[NVS] Loading schedules from NVS...");
#endif
  StaticJsonDocument<2048> doc;  // Use StaticJsonDocument for ArduinoJson v6
  DeserializationError error = deserializeJson(doc, schedulesJson);

  if (error) {
#if DEBUG_MODE
    Serial.print(F("[NVS] deserializeJson() failed: "));
    Serial.println(error.f_str());
#endif
    return;
  }

  applianceSchedules.clear();  // Clear existing schedules before loading new ones

  for (JsonPair p : doc.as<JsonObject>()) {
    String applianceName = p.key().c_str();
    JsonArray schedulesArray = p.value().as<JsonArray>();

    for (JsonObject scheduleObj : schedulesArray) {
      ScheduleEntry entry;
      entry.type = scheduleObj["type"].as<String>();
      // Convert hours and minutes to total minutes, or use direct minutes if provided
      if (scheduleObj["start_min"].is<int>()) {
        entry.start_min = scheduleObj["start_min"].as<int>();
        entry.end_min = scheduleObj["end_min"].as<int>();
      } else {
        // Legacy format conversion
        entry.start_min = scheduleObj["start_h"].as<int>() * 60 + scheduleObj["start_m"].as<int>();
        entry.end_min = scheduleObj["end_h"].as<int>() * 60 + scheduleObj["end_m"].as<int>();
      }
      applianceSchedules[applianceName].push_back(entry);
    }
  }
#if DEBUG_MODE
  Serial.println("[NVS] Schedules loaded successfully.");
#endif

  // Close schedules namespace
  preferences.end();
}

/**
 * @brief Saves current appliance schedules to NVS
 */
void saveSchedules() {
  // Switch to schedules namespace
  preferences.end();  // End current namespace
  if (!preferences.begin(NVS_NAMESPACE_SCHEDULES, false)) {
    Serial.println(F("[NVS] Failed to open schedules namespace for saving."));
    return;
  }

  StaticJsonDocument<2048> doc;  // Use StaticJsonDocument with adequate size

  for (auto const &[applianceName, schedulesVec] : applianceSchedules) {
    JsonArray schedulesArray = doc[applianceName].to<JsonArray>();
    for (const auto &entry : schedulesVec) {
      JsonObject scheduleObj = schedulesArray.add<JsonObject>();
      scheduleObj["type"] = entry.type;
      scheduleObj["start_min"] = entry.start_min;
      scheduleObj["end_min"] = entry.end_min;
    }
  }

  String schedulesJson;
  schedulesJson.reserve(RESPONSE_BUFFER_SIZE);  // Pre-allocate memory
  serializeJson(doc, schedulesJson);
  preferences.putString(NVS_KEY_SCHEDULES, schedulesJson);

#if DEBUG_MODE
  Serial.println(F("[NVS] Schedules saved successfully."));
#endif

  schedulesDirty = false;  // Reset dirty flag
  preferences.end();
}

/**
 * @brief Marks schedules as dirty and schedules a delayed save
 */
void markSchedulesDirty() {
  schedulesDirty = true;
  lastScheduleSaveMillis = millis();
}

/**
 * @brief Handles delayed schedule saving
 */
void handleDelayedScheduleSave() {
  if (schedulesDirty && (long)(millis() - lastScheduleSaveMillis) >= SCHEDULE_SAVE_DELAY_MS) {
    saveSchedules();
  }
}

/**
 * @brief Applies the intelligent control logic for a single appliance, considering custom schedules,
 * manual overrides, and temperature-based control (for heater).
 * Priority order: Temperature Control > Manual Override > Scheduled Control
 * @param app Reference to the Appliance object.
 * @param currentMinutes Current time in minutes from midnight (0-1439).
 */
void applyApplianceLogic(Appliance &app, int currentMinutes) {
  ApplianceState targetState = OFF;
  app.currentMode = SCHEDULED;

  // 1. Check for active override
  if (app.overrideEndTime > 0) {
    if (app.overrideEndTime == PERMANENT_OVERRIDE_VALUE || (long)(millis() - app.overrideEndTime) < 0) {  // Permanent or active temporary override
      targetState = app.overrideState;
      app.currentMode = OVERRIDDEN;
    } else {
      app.overrideEndTime = 0;  // Override expired
    }
  }

  // 2. Apply Scheduled Logic (only if not overridden)
  if (app.overrideEndTime == 0) {
    // Default behavior: Filter is ON by default, others are OFF by default
    bool defaultState = (app.name == "Filter");
    targetState = defaultState ? ON : OFF;

    if (applianceSchedules.count(app.name)) {
      std::vector<ScheduleEntry> &schedules = applianceSchedules[app.name];
      bool isScheduledOn = false;
      bool isScheduledOff = false;

      for (const auto &schedule : schedules) {
        if (isTimeInInterval(currentMinutes, schedule.start_min, schedule.end_min)) {
          if (schedule.type == "on_interval") {
            isScheduledOn = true;
          } else if (schedule.type == "off_interval") {
            isScheduledOff = true;
          }
        }
      }

      // Apply schedule logic based on appliance type
      if (app.name == "Filter") {
        // Filter: ON by default, turn OFF only during off_interval
        targetState = isScheduledOff ? OFF : ON;
      } else {
        // Other appliances: OFF by default, turn ON only during on_interval
        targetState = isScheduledOn ? ON : OFF;
      }
    }
    app.scheduledState = targetState;
  }

  // 3. Intelligent Heater Temperature Logic (highest priority - overrides everything)
  if (app.name == "Heater") {
    if (tempSensorError) {
      // Sensor error: override to scheduled state, do not use temp logic
      targetState = app.scheduledState;
      app.currentMode = SCHEDULED;
      heaterForcedOn = false;
      heaterOnTimeMillis = 0;
    } else if (currentTemperatureC > 0) {
      bool currentHeaterState = (targetState == ON);
      if (currentTemperatureC < TEMP_THRESHOLD_ON) {
        // Temperature too low - force heater ON
        if (!currentHeaterState && !heaterForcedOn) {
          heaterOnTimeMillis = millis();
          heaterForcedOn = true;
        }
        targetState = ON;
        app.currentMode = TEMP_CONTROLLED;
      } else if (currentTemperatureC >= TEMP_THRESHOLD_OFF) {
        // Temperature reached target - check minimum runtime
        if (heaterForcedOn && ((long)(millis() - heaterOnTimeMillis) < HEATER_MIN_RUN_TIME_MS)) {
          targetState = ON;  // Keep ON for minimum 30-minute runtime
          app.currentMode = TEMP_CONTROLLED;
        } else {
          heaterForcedOn = false;
          heaterOnTimeMillis = 0;
          targetState = OFF;
          app.currentMode = (app.overrideEndTime > 0) ? OVERRIDDEN : SCHEDULED;
        }
      }
      // Ensure minimum runtime is respected (optimized check)
      if (heaterForcedOn && targetState == OFF) {
        targetState = ON;
        app.currentMode = TEMP_CONTROLLED;
      }
    }
  }

  // Update appliance state only if changed (optimized)
  if (app.currentState != targetState) {
    app.currentState = targetState;
    setRelayState(app.pin, app.currentState);  // Use configurable relay control
    // Immediately update OLED to reflect the change
    DateTime now = rtc.now();
    updateOLED(now);
// Only log state changes for critical events (temperature control) or if debug mode
#if DEBUG_MODE
    Serial.printf("[CONTROL] %s: %s\n", app.name.c_str(), (app.currentState == ON ? "ON" : "OFF"));
#else
    if (app.name == "Heater" && app.currentMode == TEMP_CONTROLLED) {
      Serial.printf("[TEMP] Heater: %s\n", (app.currentState == ON ? "ON" : "OFF"));
    }
#endif
  }
}

/**
 * @brief Updates the OLED display with current system status including time, 
 * temperature, appliance states, and connection status.
 * Display optimized for 128x64 SSD1306 with 2-second update intervals for memory efficiency.
 * @param now Current DateTime from RTC.
 */
/**
 * @brief Updates OLED display with current status
 */
void updateOLED(DateTime now) {
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);

  // Row 1: Current Time
  display.setCursor(0, 0);
  snprintf(oledBuffer, sizeof(oledBuffer), "%02d:%02d:%02d %02d/%02d",
           now.hour(), now.minute(), now.second(), now.day(), now.month());
  display.print(oledBuffer);

  // Row 2 onwards: Appliance States with compact formatting
  int y = 10;
  for (int i = 0; i < NUM_APPLIANCES; i++) {
    display.setCursor(0, y + (i * 8));
    // Use custom short names for better readability
    const char *shortName;
    if (appliances[i].name == "Filter") shortName = "Filter";
    else if (appliances[i].name == "HangOnFilter") shortName = "HOF";
    else if (appliances[i].name == "CO2") shortName = "CO2";
    else if (appliances[i].name == "Light") shortName = "Light";
    else if (appliances[i].name == "Heater") shortName = "Heater";
    else shortName = appliances[i].name.c_str();

    snprintf(oledBuffer, sizeof(oledBuffer), "%s: %s", shortName,
             (appliances[i].currentState == ON ? "ON" : "OFF"));
    display.print(oledBuffer);
  }

  // Temperature and System Status (bottom row)
  static unsigned long lastScrollMillis = 0;
  static int scrollOffset = 0;
  const char *errorMsg = "TEMP SENSOR NOT DETECTED - CHECK CONNECTION!  ";
  int maxVisibleChars = 21;  // 128px/6px per char (font size 1)
  int errorMsgLen = strlen(errorMsg);

  display.setCursor(0, y + (NUM_APPLIANCES * 8));
  if (tempSensorError) {
    // Running text (marquee) for error message
    if (millis() - lastScrollMillis > 200) {  // Scroll every 200ms
      scrollOffset = (scrollOffset + 1) % errorMsgLen;
      lastScrollMillis = millis();
    }
    char scrollBuf[32];
    for (int i = 0; i < maxVisibleChars; i++) {
      scrollBuf[i] = errorMsg[(scrollOffset + i) % errorMsgLen];
    }
    scrollBuf[maxVisibleChars] = '\0';
    display.print(scrollBuf);
  } else {
    snprintf(oledBuffer, sizeof(oledBuffer), "%.1fC", currentTemperatureC);
    display.print(oledBuffer);
    display.setCursor(40, y + (NUM_APPLIANCES * 8));
    if (emergencyShutdown) {
      // Display specific emergency reason
      switch (currentEmergencyReason) {
        case TEMP_TOO_HIGH:
          display.print(F("TEMP HIGH"));
          break;
        case TEMP_TOO_LOW:
          display.print(F("TEMP LOW"));
          break;
        case SENSOR_FAILURE:
          display.print(F("SENSOR"));
          break;
        default:
          display.print(F("EMRG!"));
          break;
      }
    } else if (WiFi.status() == WL_CONNECTED) {
      // Show more meaningful IP info - last two octets
      IPAddress ip = WiFi.localIP();
      snprintf(oledBuffer, sizeof(oledBuffer), "%d.%d", ip[2], ip[3]);
      display.print(oledBuffer);
    } else if (apModeActive) {
      display.print(F("AP"));
    } else {
      display.print(F("NoWiFi"));
    }
  }

