mhd-riaz/Arduino/esp32-scheduler/esp32-scheduler.ino
  display.display();
}

/**
 * @brief Checks if a given time falls within a specified interval using minute-based comparison.
 * Efficiently handles both normal intervals (7:00-14:00) and overnight intervals (22:00-06:00).
 * @param currentMinutes Current time in minutes from midnight (0-1439).
 * @param startMin Start of interval in minutes from midnight (0-1439).
 * @param endMin End of interval in minutes from midnight (0-1439).
 * @return True if current time falls within the interval, false otherwise.
 */
bool isTimeInInterval(int currentMinutes, int startMin, int endMin) {
  if (startMin <= endMin) {
    // Normal interval (e.g., 420-840 = 7:00-14:00)
    return (currentMinutes >= startMin && currentMinutes < endMin);
  } else {
    // Overnight interval (e.g., 1320-360 = 22:00-06:00)
    return (currentMinutes >= startMin || currentMinutes < endMin);
  }
}

/**
 * @brief Authenticates incoming API requests using the API_KEY.
 * @param request Pointer to the AsyncWebServerRequest object.
 * @return True if authenticated, false otherwise.
 */
bool authenticateRequest(AsyncWebServerRequest *request) {
  if (request->hasHeader("X-API-Key") && request->header("X-API-Key") == API_KEY) {
    return true;
  }
  request->send(401, "application/json", "{\"error\": \"Unauthorized\", \"message\": \"Missing or invalid X-API-Key header.\"}\n");
  return false;
}

// ============================================================================
// 8. REST API Handlers
// ============================================================================

/**
 * @brief Handles the root ("/") endpoint.
 */
void handleRoot(AsyncWebServerRequest *request) {
  request->send(200, "text/plain", "ESP32 Fish Tank Automation System API. Use /status, /control, /schedules, /wifi.");
}

/**
 * @brief Handles the "/status" GET endpoint. Returns current system status.
 */
void handleStatus(AsyncWebServerRequest *request) {
  if (!authenticateRequest(request)) return;

  StaticJsonDocument<1024> doc;  // Use StaticJsonDocument for ArduinoJson v6
  DateTime now = rtc.now();

  doc["timestamp"] = now.timestamp();
  doc["temperature_celsius"] = currentTemperatureC;

  // Use doc[key].to<JsonObject>() for modern ArduinoJson
  JsonObject appliances_json = doc["appliances"].to<JsonObject>();
  for (int i = 0; i < NUM_APPLIANCES; i++) {
    JsonObject app_status = appliances_json[appliances[i].name].to<JsonObject>();
    app_status["state"] = (appliances[i].currentState == ON ? "ON" : "OFF");
    String modeStr;
    switch (appliances[i].currentMode) {
      case SCHEDULED: modeStr = "SCHEDULED"; break;
      case OVERRIDDEN: modeStr = "OVERRIDDEN"; break;
      case TEMP_CONTROLLED: modeStr = "TEMP_CONTROLLED"; break;
    }
    app_status["mode"] = modeStr;
    if (appliances[i].overrideEndTime > 0 && appliances[i].currentMode == OVERRIDDEN) {
      if (appliances[i].overrideEndTime == PERMANENT_OVERRIDE_VALUE) {
        app_status["override_type"] = "permanent";
      } else {
        app_status["override_type"] = "temporary";
        app_status["timeout_seconds"] = (appliances[i].overrideEndTime - millis()) / 1000;
      }
    }
  }

  // Update OLED to ensure it matches the API response
  updateOLED(now);

  String response;
  serializeJson(doc, response);
  request->send(200, "application/json", response);
}

/**
 * @brief Handles the "/control" POST endpoint. Allows overriding appliance states.
 * JSON Input (Consistent Array Format):
 * {
 * "appliances": [
 * {"name": "CO2", "action": "OFF", "timeout_minutes": 30},
 * {"name": "Light", "action": "ON"},
 * {"name": "Filter", "action": "ON", "timeout_minutes": 60}
 * ]
 * }
 * 
 * Single appliance example:
 * {
 * "appliances": [
 * {"name": "Heater", "action": "ON", "timeout_minutes": 120}
 * ]
 * }
 */
void handleControl(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
  if (!authenticateRequest(request)) return;

  // Check total size limit
  if (total > MAX_POST_BODY_SIZE) {
    request->send(413, "application/json", "{\"error\": \"Request body too large\"}\n");
    return;
  }

  // Store the POST body data
  if (index == 0) {
    postBody = "";
    postBody.reserve(total + 1);  // Reserve memory
  }
  for (size_t i = 0; i < len; i++) {
    postBody += (char)data[i];
  }

  // Only process when we have received all the data
  if (index + len == total) {
    StaticJsonDocument<1024> doc;  // Use StaticJsonDocument for ArduinoJson v6
    DeserializationError error = deserializeJson(doc, postBody);

    if (error) {
      Serial.print(F("[API] JSON parse failed: "));
      Serial.println(error.f_str());
      request->send(400, "application/json", "{\"error\": \"Invalid JSON\"}\n");
      return;
    }

    JsonArray appliancesArray = doc["appliances"].as<JsonArray>();

    if (appliancesArray.isNull()) {
      request->send(400, "application/json", "{\"error\": \"Missing 'appliances' array in JSON body\"}\n");
      return;
    }

    // Process appliances array
    for (JsonObject appObj : appliancesArray) {
      String appName = appObj["name"].as<String>();
      String action = appObj["action"].as<String>();
      int timeoutMinutes = appObj["timeout_minutes"] | 0;

      bool found = false;
      for (int i = 0; i < NUM_APPLIANCES; i++) {
        if (appliances[i].name == appName) {
          found = true;
          appliances[i].overrideState = (action == "ON" ? ON : OFF);
          // Prevent overflow: limit timeout to ~35 days (50000 minutes)
          if (timeoutMinutes > 50000) timeoutMinutes = 50000;
          // Use PERMANENT_OVERRIDE_VALUE for permanent override, calculated time for temporary override
          appliances[i].overrideEndTime = (timeoutMinutes > 0) ? (millis() + (unsigned long)timeoutMinutes * 60UL * 1000UL) : PERMANENT_OVERRIDE_VALUE;
          break;
        }
      }
      if (!found) {
        request->send(404, FPSTR(STR_CONTENT_TYPE_JSON), F("{\"error\": \"Appliance not found\"}\n"));
        return;
      }
    }
    request->send(200, FPSTR(STR_CONTENT_TYPE_JSON), F("{\"status\": \"success\", \"message\": \"Appliance control updated\"}\n"));
  }
}

/**
 * @brief Handles the "/schedules" GET endpoint. Returns all stored schedules. (Optimized)
 */
void handleGetSchedules(AsyncWebServerRequest *request) {
  if (!authenticateRequest(request)) return;

