mhd-riaz/Arduino/esp32-scheduler/esp32-scheduler.ino
  // Use StaticJsonDocument for better memory efficiency
  StaticJsonDocument<2048> doc;  // Use StaticJsonDocument for ArduinoJson v6
  JsonObject schedules_json = doc["schedules"].to<JsonObject>();

  for (auto const &[applianceName, schedulesVec] : applianceSchedules) {
    JsonArray schedulesArray = schedules_json[applianceName].to<JsonArray>();
    for (const auto &entry : schedulesVec) {
      JsonObject scheduleObj = schedulesArray.add<JsonObject>();
      scheduleObj["type"] = entry.type;
      scheduleObj["start_min"] = entry.start_min;
      scheduleObj["end_min"] = entry.end_min;
    }
  }

  String response;
  response.reserve(RESPONSE_BUFFER_SIZE);  // Pre-allocate to avoid reallocation
  serializeJson(doc, response);
  request->send(200, FPSTR(STR_CONTENT_TYPE_JSON), response);
}

/**
 * @brief Handles the "/schedules" POST endpoint. Allows updating all schedules.
 * JSON Input:
 * {
 * "schedules": {
 * "Filter": [
 * {"type": "off_interval", "start_min": 570, "end_min": 630}
 * ],
 * "CO2": [
 * {"type": "on_interval", "start_min": 420, "end_min": 840},
 * {"type": "on_interval", "start_min": 900, "end_min": 1260}
 * ]
 * },
 * "clear_overrides": true  // Optional: clear all active overrides
 * }
 */
void handlePostSchedules(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
  if (!authenticateRequest(request)) return;

  // Check total size limit
  if (total > MAX_POST_BODY_SIZE) {
    request->send(413, "application/json", "{\"error\": \"Request body too large\"}\n");
    return;
  }

  // Store the POST body data
  if (index == 0) {
    postBody = "";
    postBody.reserve(total + 1);  // Reserve memory
  }
  for (size_t i = 0; i < len; i++) {
    postBody += (char)data[i];
  }

  // Only process when we have received all the data
  if (index + len == total) {
    StaticJsonDocument<2048> doc;  // Use StaticJsonDocument for ArduinoJson v6
    DeserializationError error = deserializeJson(doc, postBody);

    if (error) {
      Serial.print(F("[API] deserializeJson() failed for /schedules: "));
      Serial.println(error.f_str());
      Serial.print(F("[API] Received body: "));
      Serial.println(postBody);
      request->send(400, "application/json", "{\"error\": \"Invalid JSON\"}\n");
      return;
    }

    JsonObject incomingSchedules = doc["schedules"].as<JsonObject>();
    if (incomingSchedules.isNull()) {
      request->send(400, "application/json", "{\"error\": \"Missing 'schedules' object in JSON body\"}\n");
      return;
    }

    // Optional: Clear all overrides when updating schedules
    bool clearOverrides = doc["clear_overrides"] | false;
    if (clearOverrides) {
      for (int i = 0; i < NUM_APPLIANCES; i++) {
        appliances[i].overrideEndTime = 0;  // Clear all overrides
        appliances[i].overrideState = OFF;
      }
      Serial.println("[API] All appliance overrides cleared due to clear_overrides flag");
    }

    applianceSchedules.clear();  // Clear all existing schedules

    for (JsonPair p : incomingSchedules) {
      String applianceName = p.key().c_str();
      JsonArray schedulesArray = p.value().as<JsonArray>();

      for (JsonObject scheduleObj : schedulesArray) {
        ScheduleEntry entry;
        entry.type = scheduleObj["type"].as<String>();
        // Convert hours and minutes to total minutes, or use direct minutes if provided
        if (scheduleObj["start_min"].is<int>()) {
          entry.start_min = scheduleObj["start_min"].as<int>();
          entry.end_min = scheduleObj["end_min"].as<int>();
        } else {
          // Legacy format conversion
          entry.start_min = scheduleObj["start_h"].as<int>() * 60 + scheduleObj["start_m"].as<int>();
          entry.end_min = scheduleObj["end_h"].as<int>() * 60 + scheduleObj["end_m"].as<int>();
        }
        applianceSchedules[applianceName].push_back(entry);
      }
    }

    markSchedulesDirty();  // Schedule delayed save

    // Immediately re-evaluate all appliances with new schedules
    DateTime now = rtc.now();
    int currentMinutes = now.hour() * 60 + now.minute();
    for (int i = 0; i < NUM_APPLIANCES; i++) {
      applyApplianceLogic(appliances[i], currentMinutes);
    }

    request->send(200, "application/json", "{\"status\": \"success\", \"message\": \"Schedules updated and applied immediately\"}\n");
  }
}

/**
 * @brief Handles the "/wifi" POST endpoint. Allows updating WiFi credentials.
 * JSON Input:
 * {
 * "api_key": "Automate@123", // Provided in header, but can also be in body for testing
 * "ssid": "MyNewHomeNetwork",
 * "password": "MyNewWifiPassword"
 * }
 */
void handleWifiConfig(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
  if (!authenticateRequest(request)) return;

  // Check total size limit
  if (total > MAX_POST_BODY_SIZE) {
    request->send(413, "application/json", "{\"error\": \"Request body too large\"}\n");
    return;
  }

  // Store the POST body data
  if (index == 0) {
    postBody = "";
    postBody.reserve(total + 1);  // Reserve memory
  }
  for (size_t i = 0; i < len; i++) {
    postBody += (char)data[i];
  }

  // Only process when we have received all the data
  if (index + len == total) {
    StaticJsonDocument<512> doc;  // WiFi config - small size needed
    DeserializationError error = deserializeJson(doc, postBody);

    if (error) {
      Serial.print(F("[API] deserializeJson() failed for /wifi: "));
      Serial.println(error.f_str());
      Serial.print(F("[API] Received body: "));
      Serial.println(postBody);
      request->send(400, "application/json", "{\"error\": \"Invalid JSON\"}\n");
      return;
    }

    String newSsid = doc["ssid"].as<String>();
    String newPassword = doc["password"].as<String>();

    if (newSsid.length() > 0) {
      // Switch to WiFi namespace for saving credentials
      preferences.end();  // End current namespace
      if (preferences.begin(NVS_NAMESPACE_WIFI, false)) {
        preferences.putString(NVS_KEY_SSID, newSsid);
        preferences.putString(NVS_KEY_PASS, newPassword);
        preferences.end();  // Close namespace before reboot
        Serial.printf("[NVS] New WiFi credentials saved: SSID=%s\n", newSsid.c_str());
        request->send(200, "application/json", "{\"status\": \"success\", \"message\": \"WiFi credentials saved. Rebooting to connect...\"}\n");
        delay(1000);    // Give time for response to send
        ESP.restart();  // Soft reboot to connect to new WiFi
      } else {
        request->send(500, "application/json", "{\"error\": \"Failed to save WiFi credentials\"}\n");
      }
    } else {
      request->send(400, "application/json", "{\"error\": \"SSID cannot be empty\"}\n");
    }
  }
}

/**
 * @brief Handles requests for unknown endpoints.
 */
void handleNotFound(AsyncWebServerRequest *request) {
  request->send(404, "text/plain", "Not Found");
}

// ============================================================================
// 9. System Health and Safety Functions
// ============================================================================

/**
 * @brief Emergency shutdown of all appliances
 */
void emergencyShutdownAll() {
  Serial.println("[EMERGENCY] Emergency shutdown!");
  emergencyShutdown = true;

  // Turn off all appliances immediately using proper relay control
  for (int i = 0; i < NUM_APPLIANCES; i++) {
    appliances[i].currentState = OFF;
    setRelayState(appliances[i].pin, OFF);  // Use configurable relay control
  }

