mhd-riaz/Arduino/esp32-scheduler/esp32-scheduler.ino
  // Sound emergency alert
  for (int i = 0; i < 5; i++) {
    BUZZER_TONE(BUZZER_PIN, 2000);
    delay(200);
    BUZZER_OFF(BUZZER_PIN);
    delay(200);
  }
}

/**
 * @brief Handles the "/emergency/reset" POST endpoint. Resets emergency shutdown.
 */
void handleEmergencyReset(AsyncWebServerRequest *request) {
  if (!authenticateRequest(request)) return;

  if (!emergencyShutdown) {
    request->send(400, "application/json", "{\"error\": \"No emergency shutdown active\"}\n");
    return;
  }

  // Check if conditions are safe to reset
  if (currentTemperatureC > EMERGENCY_TEMP_LOW && currentTemperatureC < EMERGENCY_TEMP_HIGH) {
    emergencyShutdown = false;
    Serial.println("[EMERGENCY] Emergency shutdown reset");
    request->send(200, "application/json", "{\"status\": \"success\"}\n");
    buzz(1, 500);  // Confirmation buzz
  } else {
    request->send(400, "application/json", "{\"error\": \"Unsafe conditions persist\"}\n");
  }
}

/**
 * @brief Handles the "/reset" POST endpoint. 
 * - Resets specific appliance overrides back to scheduled behavior, OR
 * - Performs factory reset: clears all overrides and restores default schedules
 * 
 * JSON Input for specific appliances:
 * {
 * "appliances": ["Light", "CO2"]  // Optional: specific appliances to reset
 * }
 * 
 * JSON Input for factory reset:
 * {
 * "reset_all": true  // Clears all overrides and restores default schedules
 * }
 */
void handleResetToSchedule(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
  if (!authenticateRequest(request)) return;

  // Check total size limit
  if (total > MAX_POST_BODY_SIZE) {
    request->send(413, "application/json", "{\"error\": \"Request body too large\"}\n");
    return;
  }

  // Store the POST body data
  if (index == 0) {
    postBody = "";
    postBody.reserve(total + 1);  // Reserve memory
  }
  for (size_t i = 0; i < len; i++) {
    postBody += (char)data[i];
  }

  // Only process when we have received all the data
  if (index + len == total) {
    StaticJsonDocument<512> doc;  // Use StaticJsonDocument for ArduinoJson v6
    DeserializationError error = deserializeJson(doc, postBody);

    if (error) {
      Serial.print(F("[API] JSON parse failed for /reset: "));
      Serial.println(error.f_str());
      request->send(400, "application/json", "{\"error\": \"Invalid JSON\"}\n");
      return;
    }

    bool resetAll = doc["reset_all"] | false;
    JsonArray appliancesToReset = doc["appliances"].as<JsonArray>();

    int resetCount = 0;

    if (resetAll) {
      // Factory Reset: Reset all appliances and restore default schedules
      for (int i = 0; i < NUM_APPLIANCES; i++) {
        appliances[i].overrideEndTime = 0;  // Clear override
        appliances[i].overrideState = OFF;  // Reset override state
        resetCount++;
      }

      // Load default factory schedules
      loadDefaultSchedules();

#if DEBUG_MODE
      Serial.println("[API] Factory reset completed: All appliance overrides cleared and default schedules restored");
#endif
    } else if (!appliancesToReset.isNull()) {
      // Reset specific appliances
      for (JsonVariant applianceName : appliancesToReset) {
        String appName = applianceName.as<String>();

        bool found = false;
        for (int i = 0; i < NUM_APPLIANCES; i++) {
          if (appliances[i].name == appName) {
            appliances[i].overrideEndTime = 0;  // Clear override
            appliances[i].overrideState = OFF;  // Reset override state
            found = true;
            resetCount++;
            break;
          }
        }
        if (!found) {
          request->send(404, "application/json", "{\"error\": \"Appliance not found: " + appName + "\"}\n");
          return;
        }
      }
      Serial.printf("[API] %d appliance overrides reset to schedule\n", resetCount);
    } else {
      request->send(400, "application/json", "{\"error\": \"Must specify either 'reset_all': true or 'appliances' array\"}\n");
      return;
    }

    String responseMessage;
    if (resetAll) {
      responseMessage = "Factory reset completed: " + String(resetCount) + " appliances reset and default schedules restored";
    } else {
      responseMessage = String(resetCount) + " appliances reset to schedule";
    }

    request->send(200, "application/json", "{\"status\": \"success\", \"message\": \"" + responseMessage + " (System will reboot)\"}\n");
    delay(1000);  // Allow response to be sent
    ESP.restart();
  }
}

/**
 * @brief Handles the "/refresh" POST endpoint. Forces immediate re-evaluation of all appliances.
 */
void handleForceRefresh(AsyncWebServerRequest *request) {
  if (!authenticateRequest(request)) return;

  DateTime now = rtc.now();
  int currentMinutes = now.hour() * 60 + now.minute();

  // Force re-evaluation of all appliances
  for (int i = 0; i < NUM_APPLIANCES; i++) {
    applyApplianceLogic(appliances[i], currentMinutes);
  }

  Serial.println("[API] Forced refresh of all appliances completed");
  request->send(200, "application/json", "{\"status\": \"success\", \"message\": \"All appliances refreshed with current schedules\"}\n");
}

/**
 * @brief Handles the "/schedule" POST endpoint. Updates schedule for a single appliance.
 * JSON Input:
 * {
 * "appliance": "Light",
 * "schedule": [
 * {"type": "on_interval", "start_min": 420, "end_min": 1080}
 * ],
 * "clear_override": true  // Optional: clear any active override for this appliance
 * }
 */
void handleUpdateSingleSchedule(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
  if (!authenticateRequest(request)) return;

  // Check total size limit
  if (total > MAX_POST_BODY_SIZE) {
    request->send(413, "application/json", "{\"error\": \"Request body too large\"}\n");
    return;
  }

  // Store the POST body data
  if (index == 0) {
    postBody = "";
    if (total > 0) {
      postBody.reserve(total + 1);  // Reserve memory only if total > 0
    }
  }
  for (size_t i = 0; i < len; i++) {
    postBody += (char)data[i];
  }

  // Only process when we have received all the data
  if (index + len == total) {
    StaticJsonDocument<1024> doc;  // Use StaticJsonDocument for ArduinoJson v6
    DeserializationError error = deserializeJson(doc, postBody);

    if (error) {
      Serial.print(F("[API] JSON parse failed for /schedule: "));
      Serial.println(error.f_str());
      request->send(400, "application/json", "{\"error\": \"Invalid JSON\"}\n");
      return;
    }

    String applianceName = doc["appliance"].as<String>();
    JsonArray newSchedule = doc["schedule"].as<JsonArray>();
    bool clearOverride = doc["clear_override"] | false;

