mhd-riaz/Arduino/esp32-scheduler/esp32-scheduler.ino
    if (applianceName.length() == 0) {
      request->send(400, "application/json", "{\"error\": \"Missing 'appliance' field\"}\n");
      return;
    }

    if (newSchedule.isNull()) {
      request->send(400, "application/json", "{\"error\": \"Missing 'schedule' array\"}\n");
      return;
    }

    // Verify appliance exists
    bool applianceExists = false;
    int applianceIndex = -1;
    for (int i = 0; i < NUM_APPLIANCES; i++) {
      if (appliances[i].name == applianceName) {
        applianceExists = true;
        applianceIndex = i;
        break;
      }
    }

    if (!applianceExists) {
      request->send(404, "application/json", "{\"error\": \"Appliance not found: " + applianceName + "\"}\n");
      return;
    }

    // Clear existing schedule for this appliance
    applianceSchedules[applianceName].clear();

    // Add new schedule entries
    for (JsonObject scheduleObj : newSchedule) {
      ScheduleEntry entry;
      entry.type = scheduleObj["type"].as<String>();
      // Convert hours and minutes to total minutes, or use direct minutes if provided
      if (scheduleObj["start_min"].is<int>()) {
        entry.start_min = scheduleObj["start_min"].as<int>();
        entry.end_min = scheduleObj["end_min"].as<int>();
      } else {
        // Legacy format conversion
        entry.start_min = scheduleObj["start_h"].as<int>() * 60 + scheduleObj["start_m"].as<int>();
        entry.end_min = scheduleObj["end_h"].as<int>() * 60 + scheduleObj["end_m"].as<int>();
      }
      applianceSchedules[applianceName].push_back(entry);
    }

    // Optional: Clear override for this appliance
    if (clearOverride && applianceIndex >= 0) {
      appliances[applianceIndex].overrideEndTime = 0;
      appliances[applianceIndex].overrideState = OFF;
      Serial.printf("[API] Override cleared for %s\n", applianceName.c_str());
    }

    // Save updated schedules to NVS
    markSchedulesDirty();  // Schedule delayed save

    // Immediately re-evaluate the specific appliance with new schedule
    DateTime now = rtc.now();
    int currentMinutes = now.hour() * 60 + now.minute();
    if (applianceIndex >= 0) {
      applyApplianceLogic(appliances[applianceIndex], currentMinutes);
    }

    Serial.printf("[API] Schedule updated for %s\n", applianceName.c_str());
    request->send(200, "application/json", "{\"status\": \"success\", \"message\": \"Schedule updated for " + applianceName + " and applied immediately\"}\n");
  }
}
